Функция GetKekGet(Запрос)

	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки("KEK");
	Возврат Ответ;
КонецФункции

Функция GetNotificationsМетод(Запрос)
	Попытка
		ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();
		СоответствиеВходныеПараметры = ОбщегоНазначения.ПреобразоватьJSONВСтруктуру(ТелоЗапроса, Истина);
		Если СоответствиеВходныеПараметры["payload"]["type"] <> "message" Тогда//Поддерживаются только сообщения 
			ЗаписьЖурналаРегистрации("вебхук", , ,"Неопознанный тип уведомления" , ТелоЗапроса);
		ИначеЕсли СоответствиеВходныеПараметры["payload"]["value"]["user_id"] = СоответствиеВходныеПараметры["payload"]["value"]["author_id"] Тогда //Исходящее сообщение не обрабатываем
		Иначе
			НаборЗаписей = РегистрыСведений.РеестрСообщенийАвито.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ИДСообщения.Установить(СоответствиеВходныеПараметры["payload"]["value"]["id"]);
			НаборЗаписей.Отбор.ИДЧата.Установить(СоответствиеВходныеПараметры["payload"]["value"]["chat_id"]);
						
			Строка = НаборЗаписей.Добавить();
			Строка.ИДСообщения           = СоответствиеВходныеПараметры["payload"]["value"]["id"];
			Строка.ИДЧата                = СоответствиеВходныеПараметры["payload"]["value"]["chat_id"];
			Строка.ИДПолучателя          = СоответствиеВходныеПараметры["payload"]["value"]["user_id"];
			Строка.ИДОтправителя         = СоответствиеВходныеПараметры["payload"]["value"]["author_id"];
			Строка.ТипСообщения          = АвитоСервер.ПолучитьТипСообщенияАвито(СоответствиеВходныеПараметры["payload"]["value"]["type"]);
			Строка.ДатаОтправкиСообщения = ОбщегоНазначения.ТаймСтэмпВДату(СоответствиеВходныеПараметры["payload"]["value"]["created"]); //время GMT
			Строка.Данные                = АвитоСервер.ПолучитьДанныеУведомленияПоТипу(
												СоответствиеВходныеПараметры["payload"]["value"]["content"], Строка.ТипСообщения);
			Строка.Строка                = ТелоЗапроса;			  
			НаборЗаписей.Записать();	
		КонецЕсли;
						
		Ответ = Новый HTTPСервисОтвет(200);
		Возврат Ответ;
	Исключение
		ЗаписьЖурналаРегистрации("вебхук", , , , ОписаниеОшибки());
		Ответ = Новый HTTPСервисОтвет(200);
		Возврат Ответ;
	КонецПопытки;

КонецФункции